---
type: FilterInverseRule
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FilterInverseRule

`Autodesk.Revit.DB.FilterInverseRule` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FilterInverseRule | 2011 | `public FilterInverseRule ( FilterRule innerRule )` |
| Method | GetInnerRule | 2011 | `public FilterRule GetInnerRule ()` |
| Method | SetInnerRule | 2011 | `public void SetInnerRule ( FilterRule innerRule )` |